benchmark.yml
config:
  target: 'http://localhost:3000'
  http:
    timeout: 10000  # Reduced for faster processing
    pool: 1000      # Connection pool size
  phases:
    # Warm-up phase - Start slow to test basic functionality
    - duration: 10
      arrivalRate: 10
    # Ramp-up to 100 TPS - Gradual increase to test scaling
    - duration: 20
      arrivalRate: 30
      rampTo: 100
    # Sustained 100 TPS - Test stability at moderate load
    - duration: 60
      arrivalRate: 100
    # Push to 200 TPS - Ramp up to near-target load
    - duration: 75
      arrivalRate: 200
  
   
  defaults:
    headers:
      Content-Type: 'application/json'
scenarios:
  - name: 'Send FT'
    flow:
      - post:
          url: '/send-ft'
          json:
            receiverId: 'posma-badge.testnet'  # Use different testnet account
            amount: '200'  # Small amount to avoid balance issues
            memo: 'Artillery Test'